---
kind: method
id: M:Autodesk.Revit.DB.DoubleArray.Insert(System.Double@,System.Int32)
source: html/55e65869-7621-a0a7-1a61-8367718a4ee2.htm
---
# Autodesk.Revit.DB.DoubleArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	ref double item,
	int index
)
```

## Parameters
- **item** (`System.Double %`)
- **index** (`System.Int32`)